Repository: lnascimento01/HiPaw
Catalog: lib/l10n/app_*.arb
Languages: pt

# language_title
source: Choose your language
pt: Escolha o idioma

# language_description
source: Select your preferred language to enjoy every detail.
pt: Selecione o idioma para aproveitar toda a experiência.

# language_begin
source: Let's begin
pt: Vamos começar

# language_begin_dual
source: Let's begin! / Vamos começar!
pt: Vamos começar! / Let's begin!

source: Portuguese
pt: Português

source: English
pt: Inglês

source: Loading...
pt: Carregando...

# login_title
source: Sign in
pt: Entrar

# login_welcome
source: Welcome!
pt: Bem-vindo!

# login_subtitle
source: Use your email and password to access your therapeutic journey.
pt: Use seu e-mail e senha para acessar sua jornada terapêutica.

# login_title_new
source: Welcome
pt: Bem-vindo

# login_prompt
source: Sign in or continue as a guest
pt: Faça o seu login ou entre como visitante

# login_guest
source: ENTER AS GUEST
pt: ENTRAR COMO VISITANTE

source: Create account
pt: Criar conta

source: Forgot password?
pt: Esqueceu a senha?

source: Invalid email
pt: E-mail inválido

# invalid_password
source: The password needs at least 6 characters
pt: A senha precisa de pelo menos 6 caracteres

# search_hint
source: Search exercises, materials or goals
pt: Busque por exercícios, materiais ou objetivos

# level_filter_label
source: Level
pt: Nível

# level_filter_all
source: All levels
pt: Todos os níveis

# pillar_cognitive
source: Cognitive
pt: Cognitiva

# pillar_motor
source: Motor
pt: Motora

# pillar_affective
source: Affective
pt: Afetiva

# pillar_language
source: Language
pt: Linguagem

# pillar_sensory
source: Sensory
pt: Sensorial

# recent_empty
source: You haven't opened an exercise yet.
pt: Você ainda não abriu nenhum exercício.

# recent_empty_hint
source: Start exploring and your recent sessions will appear here.
pt: Comece por aqui e seus exercícios favoritos aparecerão nesta seção.

source: Exercise not found
pt: Exercício não encontrado

source: Commands
pt: Comandos

source: Positioning
pt: Posicionamento

source: Dynamics
pt: Dinâmica

source: Video
pt: Vídeo

# account_title
source: Account
pt: Conta

# account_profile
source: Profile
pt: Perfil

# account_password_label
source: Password
pt: Senha

# account_new_password_label
source: New password
pt: Nova senha

# account_update_email
source: Update email
pt: Atualizar e-mail

# account_update_password
source: Update password
pt: Atualizar senha

# account_logout
source: Sign out
pt: Sair

# account_login_button
source: Sign in
pt: Entrar

# account_visitor_message
source: Guests do not have a profile section.
pt: Visitantes não possuem área de perfil.

# settings_feedback_subtitle
source: Share suggestions and impressions.
pt: Envie suas sugestões e impressões.

# settings_about_subtitle
source: Therapeutic app with dogs and psychomotor pillars.
pt: Aplicativo terapêutico com cães e pilares psicomotores.

# favorite_tooltip_login
source: Sign in to favorite
pt: Entre para favoritar

# favorite_tooltip_toggle
source: Favorite
pt: Favoritar

# feedback_question
source: How was it?
pt: Como foi?

# feedback_comment_hint
source: Tell us the highlights of the session
pt: Conte-nos os destaques da sessão

# feedback_info_body
source: To send your thoughts, open an exercise, choose the level you practiced and submit your review with stars and comments. For a technical review, tap the “?” helper and follow the suggested criteria.
pt: Para compartilhar suas ideias, abra um exercício, escolha o nível praticado e envie sua avaliação com estrelas e comentários. Se precisar de uma análise técnica, ative o botão “?” na tela de feedback e siga os critérios sugeridos.

# visitor_profile_message
source: Sign in to see this section.
pt: Entre para acessar esta seção.

# email_hint
source: you@email.com
pt: voce@email.com

source: Password
pt: Senha

# visitor
source: Continue as guest
pt: Entrar como visitante

source: Home
pt: Início

source: Favorites
pt: Favoritos

# exercises_tab
source: Exercises
pt: Exercícios

source: Account
pt: Conta

source: Settings
pt: Configurações

source: Recent
pt: Recentes

source: Exercises
pt: Exercícios

# home_search
source: Search exercise
pt: Pesquisar exercício

# home_view_all
source: View all
pt: Visualizar todos

source: Search
pt: Buscar

# filters
source: Pillars
pt: Pilares

# choose_level
source: Choose a level to start
pt: Escolha um nível para praticar

# levels_explanation_title
source: How levels work
pt: Sobre os níveis

# levels_explanation_text
source: Initial: guided moves with the dog close by. Intermediate: the dog adds mini challenges. Advanced: the child leads the whole mission.
pt: Inicial: movimentos guiados com apoio do cão. Intermediário: o cão participa com pequenos desafios. Avançado: a criança lidera a atividade com autonomia.

# no_favorites
source: No favorites yet
pt: Nenhum favorito ainda

source: Sign in
pt: Entrar

source: Sign out
pt: Sair

source: Change password
pt: Alterar senha

source: Change email
pt: Alterar e-mail

source: Language
pt: Idioma

source: About
pt: Sobre

# create_user
source: Create patient
pt: Criar paciente

source: Create exercise
pt: Criar exercício

source: Restricted access.
pt: Acesso restrito.

source: Title
pt: Título

source: Subtitle
pt: Subtítulo

source: Name
pt: Nome

source: Temporary password
pt: Senha temporária

source: Pillar
pt: Pilar

# video_url
source: Video link
pt: Link do vídeo

# submit
source: Send
pt: Enviar

source: Save patient
pt: Salvar paciente

source: Save exercise
pt: Salvar exercício

# docx_models_title
source: Protocol templates (DOCX)
pt: Modelos do protocolo (DOCX)

source: Use template
pt: Usar modelo

# feedbacks_received
source: Feedback received
pt: Feedbacks recebidos

# no_feedbacks
source: No feedback yet
pt: Nenhum feedback ainda

# feedback_load_error
source: Unable to load feedbacks
pt: Erro ao carregar feedbacks

# helper_objective
source: Describe briefly what the child will do with the dog.
pt: Descreva em frases curtas o que a criança fará com o cão.

# helper_materials
source: List one item per line.
pt: Separe cada item em uma linha.

# helper_steps
source: Use simple step-by-step sentences.
pt: Use frases simples no formato passo a passo.

# helper_notes
source: Optional notes displayed in the “?” modal.
pt: Observações opcionais exibidas no modal “?”.

# level_initial
source: Initial
pt: Inicial

# level_intermediate
source: Intermediate
pt: Intermediário

# level_advanced
source: Advanced
pt: Avançado

# send_feedback
source: Review exercise
pt: Avaliar exercício

source: Materials
pt: Materiais

# steps
source: Step by step
pt: Passo a passo

# objective
source: Goal
pt: Objetivo

# observations
source: Notes
pt: Observações

# extra_details
source: More details
pt: Ver detalhes

# exercise_label
source: Exercise
pt: Exercício

# exercise_levels_title
source: Exercise levels
pt: Níveis do exercício

# empty_materials
source: No special materials needed.
pt: Nenhum material específico necessário.

# empty_steps
source: Use the main description as guidance.
pt: Este nível usa apenas a explicação principal.

# empty_notes
source: No extra notes for this level.
pt: Sem orientações adicionais para este nível.

# empty_description
source: Description coming soon.
pt: Descrição disponível em breve.

source: Psychomotor pillars
pt: Pilares psicomotores

# level_goal_label
source: Goal
pt: Objetivo

# feedback_title
source: Share your feedback
pt: Compartilhe seu feedback

# feedback_prompt
source: How was your experience?
pt: Como foi sua experiência?

source: Rating
pt: Avaliação

source: Comment
pt: Comentário

# feedback_help_title
source: Suggested criteria
pt: Critérios sugeridos

# feedback_help_body
source: If the therapist wants a technical review, the protocol suggests these criteria: level of assistance, engagement, emotional/social response and movement quality. These items are optional for kids.
pt: Caso o terapeuta queira incluir avaliação técnica, estes são os critérios sugeridos pelo protocolo: nível de assistência, engajamento, resposta emocional/social e qualidade do movimento. Esses dados são opcionais para o paciente.

# feedback_rating_required
source: Choose at least one star before sending.
pt: Escolha pelo menos uma estrela antes de enviar.

# feedback_importance
source: Your feedback is important to us!
pt: Seu feedback é importante para nós!

# feedback_placeholder
source: Suggestions for improvement
pt: Sugestões de melhoria

# feedback_send
source: Send
pt: Enviar

# feedback_success
source: Feedback sent! Thank you.
pt: Feedback enviado! Obrigado por compartilhar.

# pending_feedback
source: You still have feedback to send
pt: Você tem feedback pendente

# pending_feedback_hint
source: Open the exercise again and share your thoughts.
pt: Abra o exercício e envie sua opinião.

# visitor_warning
source: Sign in to access this feature
pt: Entre para acessar este recurso

# create_account_button
source: Create account
pt: Criar conta

source: Patient area
pt: Área do paciente

source: Admin area
pt: Área do administrador

# favorites_only_logged
source: Login to favorite
pt: Faça login para favoritar

# admin_overview_title
source: Overview
pt: Visão geral

# admin_overview_description
source: Track patients, exercises, and feedback in real time.
pt: Acompanhe o progresso de pacientes, exercícios e feedbacks em tempo real.

# admin_total_patients
source: Patients
pt: Pacientes

# admin_total_exercises
source: Exercises
pt: Exercícios

# admin_total_categories
source: Categories
pt: Categorias

# admin_recent_feedbacks
source: Recent feedback
pt: Feedbacks recentes

# admin_recent_feedbacks_empty
source: No feedback available yet.
pt: Nenhum feedback disponível ainda.

# admin_quick_actions
source: Quick actions
pt: Atalhos

# admin_manage_exercises
source: Exercises
pt: Exercícios

# admin_manage_exercises_hint
source: Create and update therapeutic content.
pt: Cadastre e atualize conteúdos terapêuticos.

# admin_manage_users
source: Patients
pt: Pacientes

# admin_manage_users_hint
source: Create secure logins and monitor profiles.
pt: Crie acessos seguros e acompanhe perfis.

# admin_manage_categories
source: Categories
pt: Categorias

# admin_manage_categories_hint
source: Organize topics and therapeutic pillars.
pt: Organize temas e pilares dos exercícios.

# admin_manage_feedbacks_hint
source: Read evaluations sent by patients.
pt: Leia avaliações enviadas pelos pacientes.

# admin_existing_exercises
source: Registered exercises
pt: Exercícios cadastrados

# admin_no_exercises
source: No exercise registered yet.
pt: Nenhum exercício cadastrado ainda.

# admin_existing_patients
source: Registered patients
pt: Pacientes cadastrados

# admin_no_patients
source: No patient registered.
pt: Nenhum paciente cadastrado.

# admin_users
source: Patients & users
pt: Pacientes e usuários

# admin_categories
source: Categories
pt: Categorias

# admin_settings
source: Settings
pt: Configurações

source: Categories
pt: Categorias

# categories_empty
source: No categories yet.
pt: Nenhuma categoria cadastrada.

source: Create category
pt: Criar categoria

source: Category name
pt: Nome da categoria

# category_type
source: Type
pt: Tipo

# category_type_other
source: Other
pt: Outros

# category_delete
source: Remove category
pt: Remover categoria

source: Category
pt: Categoria

# select_category
source: Choose an available category
pt: Escolha uma categoria disponível

source: Save category
pt: Salvar categoria

source: Difficulty
pt: Dificuldade

# difficulty_hint
source: Set the predominant level for this exercise.
pt: Defina o nível predominante deste exercício.

# difficulty_beginner
source: Beginner
pt: Inicial

# difficulty_intermediate
source: Intermediate
pt: Intermediário

# difficulty_advanced
source: Advanced
pt: Avançado

# admin_settings_description
source: Adjust preferences for the admin area.
pt: Personalize preferências da área administrativa.

# language_setting_hint
source: Select the language for menus and content.
pt: Selecione o idioma para menus e conteúdos.

source: Dark mode
pt: Modo escuro

# theme_hint
source: Switch between light and dark modes.
pt: Alterne entre claro e escuro.

# admin_sign_out_hint
source: Sign out from the administrator session.
pt: Encerre a sessão deste administrador.

# role_admin
source: Administrator
pt: Administrador

# role_patient
source: Patient
pt: Paciente
